export const MESSAGE_CONFIG = {
  SUB_FINISHED: `⚠️ 你的會籍已到期，請點擊以下連結完成續訂以維持權限

續訂會籍時，請務必使用報名時相同的電子郵件，否則無法恢復權限❗

🔁 [1 個月訂閱](${process.env.ONE_MONTH_LINK})  
🔁 [3 個月訂閱](${process.env.THREE_MONTH_LINK})
`,
  SUB_RENEWED: "✅ 感謝續訂，已成功恢復「市場解剖師」身份。",
  ROLE_ADDED:
    "🍸 看來你的「市場解剖學家」角色被錯誤地移除了。別擔心，我們已經為你恢復了！",

  PERM_ROLE_ADD: "🌟 恭喜你成為「榮譽解剖師」！你已解鎖所有高階頻道。",
  REMINDER: "🔁 您的「市場解剖師」會籍將在 7 天後到期，請注意續期。",

  VIDEO_ONLY_FINISHED: `你已在觀察頻道參與了一段時間。如果你準備好，希望將過去累積的知識轉化為實質的盈利能力。立即升級至【見習市場解剖師】維持你的影片存取權，開通所有核心頻道權限，獲取導師輔導，打造屬於你的交易系統。

請聯絡 support@liquology.com 或 Discord <@987100475453231135> 獲取專屬升級優惠。`,
  VIDEO_ONLY_REMINDER: `為了獎勵你的投入，我們特別開放「升級優待」：只要在三個月內升級至【見習市場解師】，即可補回差價並獲取額外專屬優惠。
✅ 你已合資格獲取額外優惠！

請聯絡 support@liquology.com 或 Discord <@987100475453231135> 獲取你的專屬優惠碼。`,
};
